public class SingleThread {
    public static void main(String args[]) {
        /**
         * Single Thread(=Main Thread) 하나로 사용한 경우
         * 싱글 코어의 경우 단순히 CPU만을 사용하는 계산작업이라면 오히려 Multi Threading보다 Single Threading이 훨신 효율적이다
         *
         * @출력
         * ----------------------------------------------------------------------------------------------------------------------
         * ----------------------------------------------------------------------------------------------------------------------
         * ----------------------------------------------------------------소요시간 1 : 21
         * ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
         * ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
         * ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||소요시간 2 : 26
         */
        long startTime = System.currentTimeMillis();

        for(int i = 0; i < 300; i++){
            System.out.printf("%s",new String("-"));    // new String("-") : 수행시간 측정 용이하기 위해 속도 늦추는 목적으로 사용
        }

        System.out.println("소요시간 1 : " + (System.currentTimeMillis() - startTime));

        for(int i = 0; i < 300; i++){
            System.out.printf("%s",new String("|"));
        }

        System.out.println("소요시간 2 : " + (System.currentTimeMillis() - startTime));
    }
}
